In [2]:
import pandas as pd

In [4]:
data = [ [1,2,3], [4,5,6], [7,8,9]]

In [6]:
list('321')

['3', '2', '1']

In [23]:
df = pd.DataFrame(data, index = list('321'), columns = list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [21]:
df.sort_index(inplace=True)

In [24]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [26]:
df.sort_index(inplace=True, axis=1)

In [27]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [ ]:
df.sort_values()

## Testes práticos

In [28]:
data = [ ['Ary', 'M', 21], ['Cátia', 'F', 19], ['Carlos', 'M', 50], ['Beto', 'M', 29], ['Bruna', 'F', 31], ['Ana', 'F', 42],]

In [30]:
df_teste = pd.DataFrame(data, columns = ['Nome', 'Sexo', 'Idade'])

In [31]:
df_teste

     Nome Sexo  Idade
0     Ary    M     21
1   Cátia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [44]:
df_B = df_teste.sort_values(by = ['Sexo', 'Nome'])

In [48]:
df_B.index = range(df_B.shape[0])

In [49]:
df_B

     Nome Sexo  Idade
0     Ana    F     42
1   Bruna    F     31
2   Cátia    F     19
3     Ary    M     21
4    Beto    M     29
5  Carlos    M     50